In [13]:
import pandas as pd

In [10]:
india_weather = {
    'city': ['mumbai', 'delhi', 'banglore'],
    'temperature': [32, 45, 30],
    'humidity': [50, 60, 70]
}
india_weather

{'city': ['mumbai', 'delhi', 'banglore'],
 'temperature': [32, 45, 30],
 'humidity': [50, 60, 70]}

In [11]:
us_weather = {
    "city": ["new york", "seattle", "chicago"],
    "temperature": [21, 14, 35],   # fixed spelling
    "humidity": [40, 50, 75]
}
us_weather

{'city': ['new york', 'seattle', 'chicago'],
 'temperature': [21, 14, 35],
 'humidity': [40, 50, 75]}

In [12]:
# Convert dict â†’ DataFrame
india_weather = pd.DataFrame(india_weather)
us_weather = pd.DataFrame(us_weather)

# Concatenate
df = pd.concat([india_weather, us_weather], ignore_index=True)

df

       city  temperature  humidity
0    mumbai           32        50
1     delhi           45        60
2  banglore           30        70
3  new york           21        40
4   seattle           14        50
5   chicago           35        75

In [14]:
df = pd.concat([india_weather, us_weather], keys= ["india", "us"])

df

             city  temperature  humidity
india 0    mumbai           32        50
      1     delhi           45        60
      2  banglore           30        70
us    0  new york           21        40
      1   seattle           14        50
      2   chicago           35        75

In [15]:
df.loc["us"]

       city  temperature  humidity
0  new york           21        40
1   seattle           14        50
2   chicago           35        75

In [21]:
temperature_df = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore"],
    "temperature": [32,45,30]
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [22]:
windspeed_df = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore"],
    "windspeed": [7, 13, 9],
    
})
windspeed_df

       city  windspeed
0    mumbai          7
1     delhi         13
2  banglore          9

In [23]:
df = pd.concat([temperature_df, windspeed_df], axis = 1)
df

       city  temperature      city  windspeed
0    mumbai           32    mumbai          7
1     delhi           45     delhi         13
2  banglore           30  banglore          9

In [24]:
s = pd.Series(["Humid", "Dry", "Rain"], name = "event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [25]:
df = pd.concat([temperature_df,s], axis = 1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain